app/controllers/urls_controller.rb

  def short_code
    @url.update_attributes last_seen_date: Time.current,
                           redirect_count: @url.redirect_count + 1
---
UPDATE "urls" SET "redirect_count" = $1, "last_seen_date" = $2, "updated_at" = $3 WHERE "urls"."id" = $4  [["redirect_count", 1], ["last_seen_date", 2016-07-10 19:35:34 UTC], ["updated_at", 2016-07-10 19:35:34 UTC], ["id", 1]]